#### PointLightShape Members

---

|  |
| --- |
| PointLightShape Class   Constructors   Methods   Properties   See Also |

The  PointLightShape  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | PointLightShape | Creates a point light shape object. |
| Public method | PointLightShape(PointLightShape) | Creates a copy of the given point light shape |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Clone | Creates a copy of the LightShape derived object. (Inherited from  LightShape  .) |
| Public method | Dispose | (Inherited from  LightShape  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  LightShape  .) |

# See Also

PointLightShape Class

Autodesk.Revit.DB.Lighting Namespace